﻿﻿//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//*************************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//*************************************************************************
//<AMI_FHDR_START>
//
// Name:        NB.uni
//
// Description: North Bridge setup string definitions
//
//<AMI_FHDR_END>
//*************************************************************************

/=#
#include "VFR.uni"

#langdef   x-AMI "AmiMappingLanguage"           // AMI Mapping Language


#string STR_NB_CSM_VIDEO_FORM                   #language eng "External Gfx Card Primary Display Configuration"
#string STR_NB_CSM_VIDEO_PROMPT                 #language eng "External Gfx Card Primary Display Configuration"

#string STR_NB_PRIMARY_PEG                      #language eng " Primary PEG"
                                                #language x-AMI "NB001"
#string STR_NB_PRIMARY_PEG_HELP                 #language eng "Select PEG0/PEG1/PEG2/PEG3 Graphics device should be Primary PEG."

#string STR_NB_PRIMARY_PCIE                     #language eng " Primary PCIE"
                                                #language x-AMI "NB002"
#string STR_NB_PRIMARY_PCIE_HELP                #language eng "Select Auto/PCIE1/PCIE2/PCIE3/PCIE4/PCIE5/PCIE6/PCIE7 of D28:F0/F1/F2/F3/F4/F5/F6/F7, PCIE8/PCIE9/PCIE10/PCIE11/PCIE12/PCIE13/PCIE14/PCIE15 of D29:F0/F1/F2/F3/F4/F5/F6/F7, PCIE16/PCIE17/PCIE18/PCIE19 of D27:F0/F1/F2/F3, Graphics device should be Primary PCIE."

#string STR_NB_COMMON_PEG0                      #language eng "PEG10"
#string STR_NB_COMMON_PEG1                      #language eng "PEG11"
#string STR_NB_COMMON_PEG2                      #language eng "PEG12"
#string STR_NB_COMMON_PCIE0                     #language eng "PCIE0"
#string STR_NB_COMMON_PCIE1                     #language eng "PCIE1"
#string STR_NB_COMMON_PCIE2                     #language eng "PCIE2"
#string STR_NB_COMMON_PCIE3                     #language eng "PCIE3"
#string STR_NB_COMMON_PCIE4                     #language eng "PCIE4"
#string STR_NB_COMMON_PCIE5                     #language eng "PCIE5"
#string STR_NB_COMMON_PCIE6                     #language eng "PCIE6"
#string STR_NB_COMMON_PCIE7                     #language eng "PCIE7"
#string STR_NB_COMMON_PCIE8                     #language eng "PCIE8"
#string STR_NB_COMMON_PCIE9                     #language eng "PCIE9"
#string STR_NB_COMMON_PCIE10                    #language eng "PCIE10"
#string STR_NB_COMMON_PCIE11                    #language eng "PCIE11"
#string STR_NB_COMMON_PCIE12                    #language eng "PCIE12"
#string STR_NB_COMMON_PCIE13                    #language eng "PCIE13"
#string STR_NB_COMMON_PCIE14                    #language eng "PCIE14"
#string STR_NB_COMMON_PCIE15                    #language eng "PCIE15"
#string STR_NB_COMMON_PCIE16                    #language eng "PCIE16"
#string STR_NB_COMMON_PCIE17                    #language eng "PCIE17"
#string STR_NB_COMMON_PCIE18                    #language eng "PCIE18"
#string STR_NB_COMMON_PCIE19                    #language eng "PCIE19"

#string STR_NB_PEG_PORTING_CONFIGURATION_FORM   #language eng "PEG Port Feature Configuration"

#string STR_NB_PEG_ROOTPORT_PROMPT              #language eng "PEG Port Feature Configuration"
#string STR_NB_NON_COMPLIANCE                   #language eng "Detect Non-Compliance Device"
                                                #language x-AMI "NB003"
#string STR_NB_NON_COMPLIANCE_HELP              #language eng "Detect Non-Compliance PCI Express Device in PEG"

#string STR_SET_PCIE_LENGTH_PROMPT              #language eng "PCI Express Length"
                                                #language x-AMI "NB004"
#string STR_SET_PCIE_LENGTH_HELP                #language eng "Selects number of PCI Express Length"

#string STR_64MB                                #language eng "64MB"
#string STR_128MB                               #language eng "128MB"
#string STR_256MB                               #language eng "256MB"

#string STR_AUTO_STRING                         #language eng "Auto"
#string STR_ENABLED_STRING                      #language eng "Enabled"
#string STR_DISABLED_STRING                     #language eng "Disabled"

//#### string <string name>                   #language eng ""

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************